# IMDb Movie Analysis - Cleaning

![jpg](Images/tmdb-logo.jpg)

## Data Dictionaries

**Title AKAs**

![jpg](Images/title-akas-dict.jpg)

**Title Basics**

![jpg](Images/title-basics-dict.jpg)

**Title Ratings**

![jpg](Images/title-ratings-dict.jpg)

## Importing the Data

In [1]:
# Importing Pandas to read and adjust the CSV files
import pandas as pd

# Importing Numpy to adjust the null values
import numpy as np

In [2]:
# The original .tsv and .csv files were uploaded to the Data folder
# These files are read as Pandas dataframes

akas = pd.read_csv('Data/title-akas-us-only.csv', low_memory=False)

basics = pd.read_csv('Data/title-basics.tsv', sep='\t', low_memory=False)

ratings = pd.read_csv('Data/title-ratings.tsv', sep='\t', low_memory=False)

## Cleaning the Data

### AKAs

In [3]:
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,\N,imdbDisplay,\N,0
1,tt0000002,7,The Clown and His Dogs,US,\N,\N,literal English title,0
2,tt0000005,10,Blacksmith Scene,US,\N,imdbDisplay,\N,0
3,tt0000005,1,Blacksmithing Scene,US,\N,alternative,\N,0
4,tt0000005,6,Blacksmith Scene #1,US,\N,alternative,\N,0

In [4]:
akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1452564 entries, 0 to 1452563
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1452564 non-null  object
 1   ordering         1452564 non-null  int64
 2   title            1452564 non-null  object
 3   region           1452564 non-null  object
 4   language         1452564 non-null  object
 5   types            1452564 non-null  object
 6   attributes       1452564 non-null  object
 7   isOriginalTitle  1452564 non-null  object
dtypes: int64(1), object(7)
memory usage: 88.7+ MB

In [5]:
# Null values are represented by '\N'
# These values are replaced by numpy null values

akas = akas.replace({'\\N':np.nan})

akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0

In [6]:
akas['region'].value_counts()

US    1452564
Name: region, dtype: int64

### Basics

In [7]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [8]:
# The original rows for Basics is shown

basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10176402 entries, 0 to 10176401
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 698.8+ MB

In [9]:
# A filter is created for Basics using only the remaining entries in AKAs

keepers = basics['tconst'].isin(akas['titleId'])

In [10]:
# This filter is applied to the Basics dataframe
basics = basics[keepers]

# The new number of rows is shown
# The number of null values is also shown
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1364946 entries, 0 to 10176357
Data columns (total 9 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   tconst          1364946 non-null  object
 1   titleType       1364946 non-null  object
 2   primaryTitle    1364946 non-null  object
 3   originalTitle   1364946 non-null  object
 4   isAdult         1364946 non-null  object
 5   startYear       1364946 non-null  object
 6   endYear         1364946 non-null  object
 7   runtimeMinutes  1364946 non-null  object
 8   genres          1364946 non-null  object
dtypes: object(9)
memory usage: 104.1+ MB

In [11]:
basics = basics.replace({'\\N':np.nan})

basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,NaN,5,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,NaN,1,"Comedy,Short"
5,tt0000006,short,Chinese Opium Den,Chinese Opium Den,0,1894,NaN,1,Short
6,tt0000007,short,Corbett and Courtney Before the Kinetograph,Corbett and Courtney Before the Kinetograph,0,1894,NaN,1,"Short,Sport"

In [12]:
# Rows with null values under 'runtimeMinutes' are dropped

basics.dropna(subset='runtimeMinutes', inplace=True)

basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 863783 entries, 0 to 10176263
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          863783 non-null  object
 1   titleType       863783 non-null  object
 2   primaryTitle    863783 non-null  object
 3   originalTitle   863783 non-null  object
 4   isAdult         863783 non-null  object
 5   startYear       855063 non-null  object
 6   endYear         21069 non-null   object
 7   runtimeMinutes  863783 non-null  object
 8   genres          854752 non-null  object
dtypes: object(9)
memory usage: 65.9+ MB

In [13]:
# Rows with null values under 'genres' are dropped

basics.dropna(subset='genres', inplace=True)

basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 854752 entries, 0 to 10176263
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          854752 non-null  object
 1   titleType       854752 non-null  object
 2   primaryTitle    854752 non-null  object
 3   originalTitle   854752 non-null  object
 4   isAdult         854752 non-null  object
 5   startYear       846106 non-null  object
 6   endYear         20692 non-null   object
 7   runtimeMinutes  854752 non-null  object
 8   genres          854752 non-null  object
dtypes: object(9)
memory usage: 65.2+ MB

In [14]:
# All values under 'titleType' are shown

basics['titleType'].value_counts()

short           278617
movie           203967
tvEpisode       173972
video           115750
tvSeries         36826
tvMovie          25957
tvSpecial         9339
tvMiniSeries      6019
tvShort           4108
videoGame          197
Name: titleType, dtype: int64

In [15]:
# A filter only including the value 'movie' under 'titleType' is created
# and stored

basics = basics[basics['titleType'] == 'movie']

# The new value counts are shown; only 'movie' remains
basics['titleType'].value_counts()

movie    203967
Name: titleType, dtype: int64

In [16]:
basics['startYear'].dtype

dtype('O')

In [17]:
# 'startYear' is changed to dtype 'float'
basics['startYear'] = basics['startYear'].astype(float)

# Dtype is confirmed
basics['startYear'].dtype

dtype('float64')

In [18]:
# A filter is created and stored
# Only values within a certain yearframe are included

basics = basics[(basics['startYear'] >= 2000) & (basics['startYear'] <= 2021)]

# The new value counts are shown
basics['startYear'].value_counts()

2019.0    8101
2018.0    7864
2017.0    7814
2016.0    7413
2015.0    7231
2014.0    7169
2020.0    7031
2013.0    6945
2021.0    6923
2012.0    6593
2011.0    6120
2010.0    5584
2009.0    5087
2008.0    4243
2007.0    3607
2006.0    3341
2005.0    2924
2004.0    2535
2003.0    2191
2002.0    2003
2001.0    1933
2000.0    1790
Name: startYear, dtype: int64

In [19]:
# A filter is created and stored
# containing only entries under 'genres' that contain the word 'documentary'
# where capitalization does not matter

is_documentary = basics['genres'].str.contains('documentary',case=False)

# The filter is applied. The tilde reverses the boolean function
# removing all entries including 'documentary' instead of saving them
basics = basics[~is_documentary]

### Ratings

In [20]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1993
1  tt0000002            5.8       268
2  tt0000003            6.5      1879
3  tt0000004            5.5       177
4  tt0000005            6.2      2663

In [21]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1351320 entries, 0 to 1351319
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1351320 non-null  object
 1   averageRating  1351320 non-null  float64
 2   numVotes       1351320 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 30.9+ MB

In [22]:
# A filter is created for Ratings using only the remaining entries in Basics

keepers = ratings['tconst'].isin(basics['tconst'])

keepers

0          False
1          False
2          False
3          False
4          False
           ...
1351315    False
1351316    False
1351317    False
1351318    False
1351319    False
Name: tconst, Length: 1351320, dtype: bool

In [23]:
ratings = ratings[keepers]

ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 68088 entries, 17920 to 1351291
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         68088 non-null  object
 1   averageRating  68088 non-null  float64
 2   numVotes       68088 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.1+ MB

In [24]:
ratings = ratings.replace({'\\N':np.nan})

ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 68088 entries, 17920 to 1351291
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         68088 non-null  object
 1   averageRating  68088 non-null  float64
 2   numVotes       68088 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.1+ MB

## Data Overview

In [25]:
akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1452564 entries, 0 to 1452563
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1452564 non-null  object
 1   ordering         1452564 non-null  int64
 2   title            1452564 non-null  object
 3   region           1452564 non-null  object
 4   language         4018 non-null     object
 5   types            981678 non-null   object
 6   attributes       47016 non-null    object
 7   isOriginalTitle  1451222 non-null  object
dtypes: int64(1), object(7)
memory usage: 88.7+ MB

In [26]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 81890 entries, 34800 to 10176168
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81890 non-null  object
 1   titleType       81890 non-null  object
 2   primaryTitle    81890 non-null  object
 3   originalTitle   81890 non-null  object
 4   isAdult         81890 non-null  object
 5   startYear       81890 non-null  float64
 6   endYear         0 non-null      object
 7   runtimeMinutes  81890 non-null  object
 8   genres          81890 non-null  object
dtypes: float64(1), object(8)
memory usage: 6.2+ MB

In [27]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 68088 entries, 17920 to 1351291
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         68088 non-null  object
 1   averageRating  68088 non-null  float64
 2   numVotes       68088 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 2.1+ MB

## Saving the New Data

In [28]:
# The cleaned dataframes are saved to the Data folder

akas.to_csv("Data/title_akas-us-only.csv.gz",compression='gzip',index=False)

akas = pd.read_csv("Data/title_akas-us-only.csv.gz", low_memory = False)

akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [29]:
basics.to_csv("Data/title_basics.csv.gz",compression='gzip',index=False)

basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)

basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016.0,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"

In [30]:
ratings.to_csv("Data/title_ratings.csv.gz",compression='gzip',index=False)

ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)

ratings.head()

      tconst  averageRating  numVotes
0  tt0035423            6.4     87565
1  tt0062336            6.4       180
2  tt0068865            5.4        74
3  tt0069049            6.7      7830
4  tt0088751            5.2       340